lexidarling/esp-exp/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.ZigbeeMode=Zigbee Mode
menu.PinNumbers=Pin Numbering

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length
menu.SLOW_CLK_TPYE=Slow Clk Type(only for LoRaWAN)
menu.einksize=E-Ink Display Size
menu.NetworkLogLevel=Network Log Level
##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

##############################################################

esp-exp.name=ESP-EXP

esp-exp.bootloader.tool=esptool_py
esp-exp.bootloader.tool.default=esptool_py

esp-exp.upload.tool=esptool_py
esp-exp.upload.tool.default=esptool_py
esp-exp.upload.tool.network=esp_ota

esp-exp.upload.maximum_size=1310720
esp-exp.upload.maximum_data_size=327680
esp-exp.upload.flags=
esp-exp.upload.extra_flags=

esp-exp.serial.disableDTR=true
esp-exp.serial.disableRTS=true

esp-exp.build.tarch=xtensa
esp-exp.build.bootloader_addr=0x1000
esp-exp.build.target=esp32
esp-exp.build.mcu=esp32
esp-exp.build.core=esp32
esp-exp.build.variant=esp-exp
esp-exp.build.board=ESP-EXP

esp-exp.build.f_cpu=240000000L
esp-exp.build.flash_size=4MB
esp-exp.build.flash_freq=80m
esp-exp.build.flash_mode=dio
esp-exp.build.boot=dio
esp-exp.build.partitions=default
esp-exp.build.defines=

esp-exp.menu.PartitionScheme.default=Default
esp-exp.menu.PartitionScheme.default.build.partitions=default
esp-exp.menu.PartitionScheme.no_ota=No OTA (Large APP)
esp-exp.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp-exp.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp-exp.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
esp-exp.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp-exp.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp-exp.menu.PartitionScheme.custom=Custom
esp-exp.menu.PartitionScheme.custom.build.partitions=
esp-exp.menu.PartitionScheme.custom.upload.maximum_size=16777216

esp-exp.menu.UploadSpeed.921600=921600
esp-exp.menu.UploadSpeed.921600.upload.speed=921600
esp-exp.menu.UploadSpeed.115200=115200
esp-exp.menu.UploadSpeed.115200.upload.speed=115200
esp-exp.menu.UploadSpeed.256000.windows=256000
esp-exp.menu.UploadSpeed.256000.upload.speed=256000
esp-exp.menu.UploadSpeed.230400.windows.upload.speed=256000
esp-exp.menu.UploadSpeed.230400=230400
esp-exp.menu.UploadSpeed.230400.upload.speed=230400
esp-exp.menu.UploadSpeed.460800.linux=460800
esp-exp.menu.UploadSpeed.460800.macosx=460800
esp-exp.menu.UploadSpeed.460800.upload.speed=460800
esp-exp.menu.UploadSpeed.512000.windows=512000
esp-exp.menu.UploadSpeed.512000.upload.speed=512000

esp-exp.menu.DebugLevel.none=None
esp-exp.menu.DebugLevel.none.build.code_debug=0
esp-exp.menu.DebugLevel.error=Error
esp-exp.menu.DebugLevel.error.build.code_debug=1
esp-exp.menu.DebugLevel.warn=Warn
esp-exp.menu.DebugLevel.warn.build.code_debug=2
esp-exp.menu.DebugLevel.info=Info
esp-exp.menu.DebugLevel.info.build.code_debug=3
esp-exp.menu.DebugLevel.debug=Debug
esp-exp.menu.DebugLevel.debug.build.code_debug=4
esp-exp.menu.DebugLevel.verbose=Verbose
esp-exp.menu.DebugLevel.verbose.build.code_debug=5

esp-exp.menu.EraseFlash.none=Disabled
esp-exp.menu.EraseFlash.none.upload.erase_cmd=
esp-exp.menu.EraseFlash.all=Enabled
esp-exp.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
